
''''
#01 基本概念
##  几个概念
1.表达式
    表达式一般仅仅用了计算一些结果，不会对程序产生实质性的影响
    如果在交互中输入一个表达式，解释器会自动将表达式的结果输出

2.语句
    在程序中语句一般需要完成某种功能，比如打印信息，获取信息，为变量
    赋值。。。
    比如：
        print（）
        a =10
        语句的执行一般会对程序产生一定的影响
        在交互模式中不一定会输出语句的执行结果

3.程序（program）
    程序就是由一条一条的语句和一条一条的表达式构成的。

4.函数（function）
    函数就是一种语句，函数专门用来完成特定的功能
    函数长得形如：xxx（）
    函数的分类：
        内置函数
        自定义函数
            -由Python解释器提供的函数，可以在Python中直接使用
        自定义函数
            -由程序员自主创建的函数

    当我们需要完成某个功能时，就可以去调用内置函数，或者自定义函数
    函数的两个要素：
        参数
            -（）中的内容就是函数的参数
            -函数中可以没有参数，也可以有多个参数，多个参数之间使用，隔开
        返回值
            -返回值是函数的返回结果，不是所有的函数都有返回值







'''